Public Attributes | List of all members
API_CameraType Struct Reference
Element Manager
Represents a single camera. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_Guid  | camSetGuid
This camera belongs to this camera set.
 API_PerspCamPars  | perspCam
Perspective camera parameters.
Detailed Description
Represents a single camera.